In [65]:
import pandas as pd
import numpy as np
from datetime import datetime, timedelta

log = pd.read_csv('log.csv.xls', encoding='utf-8', header=None)
user = pd.read_csv('users.csv.xls', encoding='koi8_r', sep='\t', header=None)

log.columns = ['user_id', 'time', 'bet', 'win']
user.columns = ['user_id', 'email', 'geo']

def correct_id(user):
    if '#error' in user:
        return ''
    else:
        return user[user.find("user"):]
log.user_id = log.user_id.apply(correct_id)
log.time = log.time.str.replace('[', '')

In [66]:
log.head()

    user_id                 time  bet  win
0  user_919  2019-01-01 14:06:51  NaN  NaN
1  user_973  2019-01-01 14:51:16  NaN  NaN
2  user_903  2019-01-01 16:31:16  NaN  NaN
3  user_954  2019-01-01 17:17:51  NaN  NaN
4  user_954  2019-01-01 21:31:18  NaN  NaN

In [67]:
user.head()

    user_id                email        geo
0    Юзверь                 мейл        Гео
1  User_943  Accumanst@gmail.com     Ижевск
2  User_908    Advismowr@mail.ru     Ижевск
3  User_962      Anachso@ukr.net  Краснодар
4  User_973     Antecia@inbox.ru      Пермь

In [4]:
def isna(col):
    c=0
    for i in log[col].isna():
        if i==True:
            c+=1
    return c
isna('time')

15

In [68]:
log.dropna(axis=0)

      user_id                 time        bet        win
14   user_917   2019-01-02 8:57:36   145732.0  1987653.0
29   user_942  2019-01-04 13:59:42  1678321.0  9876543.0
151  user_982  2019-01-16 21:54:22      100.0     4749.0
189  user_964  2019-01-21 18:34:44      200.0     4667.0
205  user_931   2019-01-22 5:26:59      300.0     4319.0
..        ...                  ...        ...        ...
967  user_975  2019-04-19 22:25:15     1000.0     6108.0
971  user_912  2019-04-20 10:35:49    10554.0    31799.0
972  user_926  2019-04-20 10:35:50    10354.0    30244.0
976  user_970  2019-04-20 10:35:54    10354.0    30691.0
991  user_965  2019-04-20 12:55:41      800.0     6927.0

[133 rows x 4 columns]

In [33]:
isna('time')

15

In [69]:
log.drop_duplicates(subset=['time', 'user_id'])

      user_id                 time      bet     win
0    user_919  2019-01-01 14:06:51      NaN     NaN
1    user_973  2019-01-01 14:51:16      NaN     NaN
2    user_903  2019-01-01 16:31:16      NaN     NaN
3    user_954  2019-01-01 17:17:51      NaN     NaN
4    user_954  2019-01-01 21:31:18      NaN     NaN
..        ...                  ...      ...     ...
991  user_965  2019-04-20 12:55:41    800.0  6927.0
992  user_967  2019-04-20 14:59:36  10154.0     NaN
993  user_973  2019-04-20 17:09:56  10254.0     NaN
994  user_977  2019-04-20 18:10:07  10354.0     NaN
995  user_984   2019-04-20 9:59:58   9754.0     NaN

[986 rows x 4 columns]

In [8]:
def time_normalize(row):
#     date_format=
    for i in row:
        date_format = datetime.strptime(i, '%Y-%m-%d')
        i = date_format

In [72]:
log.time = pd.to_datetime(log.time, format='%Y-%m-%d %H:%M:%S')

In [64]:
log

      user_id  time        bet        win
14   user_917    57   145732.0  1987653.0
29   user_942    59  1678321.0  9876543.0
151  user_982    54      100.0     4749.0
189  user_964    34      200.0     4667.0
205  user_931    26      300.0     4319.0
..        ...   ...        ...        ...
967  user_975    25     1000.0     6108.0
971  user_912    35    10554.0    31799.0
972  user_926    35    10354.0    30244.0
976  user_970    35    10354.0    30691.0
991  user_965    55      800.0     6927.0

[133 rows x 4 columns]

In [61]:
log = log.dropna()  
log.columns = ['user_id', 'time', 'bet', 'win']  
# log['time'] = log['time'].apply(lambda x: x[1:])  
log['time'] = pd.to_datetime(log['time'])  
log['time'] = log['time'].apply(lambda x: x.minute)  
log['time'].head()

14     57
29     59
151    54
189    34
205    26
Name: time, dtype: int64

In [73]:
log.time[1].year

2019

In [76]:
year_column = log.time.apply(lambda x: x.year)

In [79]:
year_column = log.time.dt.year
# year_column

Аксессор - это атрибут столбца, который хранит переменные типа Timestamp, то есть переменные, которые были строковым представлением времени, а затем изменены с помощью pd.to_datetime(). Если вы попытаетесь обратиться к dt у столбца, в котором лежит что-то отличное от времени, вы получите ошибку.

In [83]:
min_col = log.time.dt.minute
min_col.value_counts().head()

36.0    25
31.0    23
6.0     22
50.0    22
14.0    21
Name: time, dtype: int64

In [85]:
month_col = log.time.dt.month
month_col.value_counts(ascending=True).head()

pandas.core.series.Series

In [95]:
day_col = log.time.dt.dayofweek
day_col
count = day_col.value_counts()
count

5.0    152
2.0    150
1.0    150
0.0    135
4.0    135
3.0    132
6.0    131
Name: time, dtype: int64

In [97]:
def time_to_day(t):
    if (t.hour >= 0 and t.hour <= 5):
        return 'Night'
    if (t.hour >= 6 and t.hour <= 11):
        return 'Morning'
    if (t.hour >= 12 and t.hour <= 17):
        return 'Day'
    if (t.hour >= 18 and t.hour <= 23):
        return 'Evening'
    
log['day_time'] = log.time.apply(time_to_day)

In [99]:
log.day_time.value_counts(ascending=True)

Evening    227
Day        240
Morning    253
Night      265
Name: day_time, dtype: int64

In [108]:
log = pd.read_csv('log.csv.xls', encoding='utf-8', header=None)
log.columns = ['user_id', 'time', 'bet', 'win']
log.user_id = log.user_id.apply(correct_id)
log.time = log.time.str.replace('[', '')
log.dropna(axis=0)
log.time = pd.to_datetime(log.time, format='%Y-%m-%d %H:%M:%S')
time_col = log.time.dt.hour
log['hour'] = time_col

In [109]:
log

      user_id                time      bet      win  hour
0    user_919 2019-01-01 14:06:51      NaN      NaN  14.0
1    user_973 2019-01-01 14:51:16      NaN      NaN  14.0
2    user_903 2019-01-01 16:31:16      NaN      NaN  16.0
3    user_954 2019-01-01 17:17:51      NaN      NaN  17.0
4    user_954 2019-01-01 21:31:18      NaN      NaN  21.0
..        ...                 ...      ...      ...   ...
995  user_984 2019-04-20 09:59:58   9754.0      NaN   9.0
996                           NaT  10054.0  29265.0   NaN
997                           NaT  10454.0      NaN   NaN
998                           NaT   1000.0      NaN   NaN
999                           NaT  10754.0      NaN   NaN

[1000 rows x 5 columns]